text = "БОРОДИНО"
print("\t"*4,text.upper())
print("\n"*3,"\t"*2,"— Скажи-ка, дядя, ведь не даром")
print("\t"*2,"  Мо"+"сква, спаленная пожаром,")
print("\t"*3,"Фран"+"цузу отдана?")
print("\t"*2,"Ведь были ж схватки боевые,")
print("\t"*2,"Да, говорят, еще какие!")
print("\t"*2,"Недаром помнит вся Рос"+"сия")
print("\t"*3,"Про день Бородина")


print("\n"*3,"\t"*2,"— Да, были лю"+"ди в наше время,")
print("\t"*2,"Не то, что нынешнее племя:")
print("\t"*3,"Бога"+"тыри — не вы!")
print("\t"*2,"Плохая им досталась доля:")
print("\t"*2,"Нем"+"ногие вернулись с поля...")
print("\t"*2,"Не будь на то господня воля,")
print("\t"*3,"Про день Боро"+"дина")


print("\n"*3,"\t"*2,"Мы долго мол"+"ча отступали,")
print("\t"*2,"Досадно было, боя ждали,")
print("\t"*3,"Ворчали старики:")
print("\t"*2,"«Что ж мы? на зим"+"ние квартиры?")
print("\t"*2,"Не смеют, что ли, коман"+"диры")
print("\t"*2,"Чужие изорвать мун"+"диры")
print("\t"*3,"Про день Боро"+"дина")
