'''Вычислить площадь круга S=pi*r*r, pi описать как константу,
значение переменной r ввести с клавиатуры.'''

pi = 3.14
pi = float(pi)
r = float(input('Введите радиус = '))
S = pi * r * r
print("Площадь окружности = ", S)
input("Press Enter to continue...")
