'''Вычислить зарплату рабочего за Х дней работ,
если он получает фиксированный заработок за 1 день.
Заработок за 1 день описать как константу,
значение переменной к ввести с клавиатуры.
 '''

zarplata = 100
zarplata = int(zarplata)
workDays = int(input("Что б узнать з\п. Введите кол-во рабочих дней = "))
moneyWork = zarplata * workDays
print("Заработная плата составила = ",moneyWork)





input("Press Enter to continue...")
